# -*- coding: utf-8 -*- 
# @Author: Kun
# @Time: 20240114 
# @Email: zhaozk_bjtu@163.com
# @Software: Vscode

""" 盛最多水的容器 """
# ====================================================================================================================================#
#   经典题解：
#   https://leetcode.cn/problems/container-with-most-water/solutions/11491/container-with-most-water-shuang-zhi-zhen-fa-yi-do
#   内附算法正确性证明
#   NOTE(Kun, 20240114): 感觉很有意思, 算法力求直接找到最大值，证明证的是操作过程中不会略过最大值
#       感觉，算法和证明是两个思路逆着来的碰撞。精彩。
# ====================================================================================================================================#
""" 双指针可解. """

